# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'

# Development
brew 'php'
brew 'php@7.4'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'alfred'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'insomnia'
cask 'java'
cask 'phpstorm'
cask 'sip'
cask 'skype'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'vlc'
cask 'whatsapp'
cask 'notion'


# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
